IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/I2C0_1.0.xml
        <register id="I2C0_SFIFOCTL" width="32" offset="0x1C" description="I2C Slave FIFO Control">
            <bitfield id="TXTRIG" description="TX FIFO Trigger
Indicates at what fill level in the TX FIFO a trigger will be generated." begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="LEVEL_4" value="0x4" description="Trigger when TX FIFO contains  4 byte"/>
                <bitenum id="LEVEL_5" value="0x5" description="Trigger when TX FIFO contains  5 byte"/>
                <bitenum id="LEVEL_6" value="0x6" description="Trigger when TX FIFO contains  6 byte"/>
                <bitenum id="LEVEL_7" value="0x7" description="Trigger when TX FIFO contains  7 byte"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
Setting this bit will Flush the TX FIFO.
Before reseting this bit to stop Flush the TXFIFOCNT should be checked to be 8 and indicating that the Flush has completed." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
Setting this bit will Flush the RX FIFO.
Before reseting this bit to stop Flush the RXFIFOCNT should be checked to be 0 and indicating that the Flush has completed." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
            <bitfield id="RXTRIG" description="RX FIFO Trigger
Indicates at what fill level in the RX FIFO a trigger will be generated.
Note: Programming RXTRIG to 0x0 has no effect since no data is
present to transfer out of RX FIFO." begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="LEVEL_5" value="0x4" description="Trigger when RX FIFO contains &gt;= 5 byte"/>
                <bitenum id="LEVEL_6" value="0x5" description="Trigger when RX FIFO contains &gt;= 6 byte"/>
                <bitenum id="LEVEL_7" value="0x6" description="Trigger when RX FIFO contains &gt;= 7 byte"/>
                <bitenum id="LEVEL_8" value="0x7" description="Trigger when RX FIFO contains &gt;= 8 byte"/>
            </bitfield>
        </register>
        <register id="I2C0_SFIFOSR" width="32" offset="0x20" description="I2C Slave FIFO Status Register">
            <bitfield id="RXFIFOCNT" description="Number of Bytes which could be read from the RX FIFO" begin="3" end="0" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="TXFIFOCNT" description="Number of Bytes which could be put into the TX FIFO" begin="11" end="8" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
When this bit is set a Flush operation for the TX FIFO is active. Clear the TXFLUSH bit in the control register to stop." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFO Flush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
When this bit is set a Flush operation for the RX FIFO is active. Clear the RXFLUSH bit in the control register to stop." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFOFlush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
        </register>
        <register id="I2C0_SLAVE_PECCTL" width="32" offset="0x24" description="I2C Slave PEC control register">
            <bitfield id="PECCNT" description="When this field is non zero, the number of I2C data bytes are counted. When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

In the normal Slave use case, FW would set PECEN=1 and PECCNT=0 and use the ACKOEN until the remaining SMB packet length is known. FW would then set the PECCNT to the remaining packet length (Including PEC bye). FW would then configure DMA to allow the packet to complete unassisted and exit NoAck mode.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction" begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits accept the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="PEC transmission and check is disabled"/>
                <bitenum id="ENABLE" value="0x1" description="PEC transmission and check is enabled"/>
            </bitfield>
        </register>
        <register id="I2C0_SLAVE_PECSR" width="32" offset="0x28" description="I2C slave PEC status register">
            <bitfield id="PECBYTECNT" description="This is the current PEC Byte Count of the Slave State Machine." begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates PEC was checked in the transaction that occurred before the last Stop"/>
            </bitfield>
            <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates PEC check error occurred in the transaction that occurred before the last Stop"/>
            </bitfield>
        </register>
    </group>
</module>
